[{"time":"0:00","person":"Edward","dialogue":"It's not clear what screen I need to share. Let's try this. It just says Google. Unfortunately I have several google chrome windows open right now. Let me do this."},{"time":"0:34","person":"Ankit Mehta","dialogue":"Sorry,"},{"time":"1:35","person":"Edward","dialogue":"So this is making me restart zoom so I'll be right back. Okay, all right. Okay."},{"time":"1:43","person":"Ankit Mehta","dialogue":"I woke you up, didn't"},{"time":"2:29","person":"Edward","dialogue":"Okay. Can you see now,"},{"time":"2:30","person":"Ankit Mehta","dialogue":"yes yes yes I can."},{"time":"2:32","person":"Edward","dialogue":"Okay. Might you walk me through what this is doing."},{"time":"2:38","person":"Shuo Han","dialogue":"Yeah, could you go to the one that says on given vector form database. That's because this is the initial one, the one we were just seeing was actually extracted summary. And these are actually a lot more. This is the descriptive summary part of at least most of it so the initial version of this was just that we'd have this list of summary is this this is actually a summary of a meeting that's 30 to. 45 minutes long. And, yeah. And if you scroll to the very end, what you actually get to see is that you can set the agenda. So if you click on the agenda, you can click on it, you can edit it, you can actually edit the action items. This is the action items and things like that is something we've generated by hand for display purposes, we haven't actually figured out a way to like actually, you know, decide what the action items are programmatically, but it is something that you can edit and the agenda is something that, yes. So now, What just happened was you clicked on one of the highlighted areas. And it took you to a place where it shows the. It shows the, the transcript, and where exactly you click where that is in the transcript, and also the ability to actually edit the summary."},{"time":"4:16","person":"Edward","dialogue":"Where's the summary,"},{"time":"4:17","person":"Ankit Mehta","dialogue":"this is somebody that editable part is the summary,"},{"time":"4:21","person":"Edward","dialogue":"this is the summary Yes, it's a summary of"},{"time":"4:24","person":"Ankit Mehta","dialogue":"what, though. Exactly. Actually, this is the summary of the whole, whole transcript, we're actually playing it"},{"time":"4:32","person":"Edward","dialogue":"just looks like the transcript."},{"time":"4:35","person":"Ankit Mehta","dialogue":"The transcript is was, what is on top, right now, like do you see two divs right. One is, this is the transcript with the timestamps and the editable part is the summary, I think it would make sense in a way to type, maybe edit somebody on top of it so it becomes more clear what exactly we're looking at."},{"time":"4:59","person":"Edward","dialogue":"So basically the like initial like the meeting is pretty long so we'd like split the whole meeting to several dialogues. So like the summaries, January from each dialogue. So, this is a summary right here. Yes, related to this highlight. And then this is the summary related to this highlight, no,"},{"time":"5:27","person":"Ankit Mehta","dialogue":"no. So just sometimes part, that what the highlight exactly are is something we're still trying to figure out, but highlights are just part of the like words set of words on the summary that exactly match something in the transcript. So you can exactly go there if you just want to see around that area what people were talking about."},{"time":"5:55","person":"Edward","dialogue":"Okay. Alright, so we're gonna go back and click on this, and you can do multiple files, you can do that. Alright, so that is this. Yes. And so what is the relationship of this, to this content here,"},{"time":"6:15","person":"Ankit Mehta","dialogue":"this content here will have some place that says, you know, the same thing that like. So this is extracted from here, you know, the opposite."},{"time":"6:30","person":"Edward","dialogue":"And you can. Right, so this is just this statement right here. Yes,"},{"time":"6:39","person":"Ankit Mehta","dialogue":"it's. So, the thing above is the transcript. And the thing below is the summary, and we're just telling you trying to show you where exactly from the summary, the transcript is where the summary is coming from in the transcript. So, in a, in, like, in a more sophisticated version of this product what I, what would actually start happening, is once you click on this, we since you would have the voice recording the voice recording would start playing from that location. Okay. Right now, it's very very basic on how things are highlighted. It's it's actually just a simple way of like looking what exactly matches, word to word in the transcript and the summary. But moving forward, I think it would make sense to make shorter summaries and have it segmented by by topic. So you'd click on a certain topic in the summary, and then we'd go to like the place in the transcript where that topic was being discussed."},{"time":"7:42","person":"Edward","dialogue":"So, how does this get created. Yes. Is this, is that just, That's not a transcript that's a summary of this transcript of here."},{"time":"7:51","person":"Ankit Mehta","dialogue":"Yes."},{"time":"7:52","person":"Edward","dialogue":"And how is this beginning generated or created."},{"time":"7:55","person":"Ankit Mehta","dialogue":"So take it away. If you could just explain that. Yeah, so like the. Oh,"},{"time":"8:02","person":"Edward","dialogue":"I think we have like spelling to, like, too many sentences in this one. So we really like have only like two or three dialogues for a meeting. I think the summary will be more concise. So feel like if there's only one say like back and forth by people peep, like a person they talk to them personally talks. And we summarize this conversation in for each of them, so I feel like that might be like too much. I visual how I more back and forth and conversations, and then do the summary and then is this summary being generated by machine learning or, yep. Okay, okay. And what is the machine learning doing to the transcript to result in this summary. Okay, so like the like basically the model has three parts. The first part is called I guess stage segmentation. We are each tries to find like different stages of the conversation like the introduction, like the beginning like the ending. That's what called like stage segmentation, and the second one is called like topic segmentation. So he's tries to I find out the topics we are talking about in the conversation. And there are some like predefined topics, to see if they kind of like mesh with them. So that's called topic segmentation, and the model will take into like, both segmentations and the transcript and generate this kind of stuff. Go down with your model. Okay, so these are the, so a lot of this are the topics that you've discussed and in segmented, depending on where in the conversation that occurred. Yep. Okay, okay, okay, okay, that, that's, that's a good start. And, um, let's see, so if I go back over here"},{"time":"10:20","person":"Ankit Mehta","dialogue":"to go back, I think you need to go to the very top and yeah just click on the arrow button, yeah."},{"time":"10:26","person":"Edward","dialogue":"Okay, okay, Okay. All right, so when a user arrives at this screen, what are they expected to do."},{"time":"10:39","person":"Ankit Mehta","dialogue":"So users arrived at this screen after they've done the meeting and come over here and so is the instance, in case they didn't take any notes or they took notes that they don't feel they need to, they feel they need to verify, then they will go through this summary and and use this summary to actually make their notes, or like, the process that program managers at Squarespace go through is that, I mean they everyone takes very diligent notes at least from the conversations that I've been having, but they take notes, they get them verified by the people who attended the meeting, and then they send them out to like whoever is actually supposed to be CC Ron that kind of information. So, where we will be augmenting this process would be, in case you didn't take notes or feel like didn't take the best of notes, then this would help you improve your improve your, you know, the final meeting notes that you're actually sending meeting summary this is what would help you, and then the at the very end, things that we want to add are like tag places which are decisions and actions to be taken next. So like, but that's something we're still actually trying to figure out, we don't have that yet."},{"time":"11:57","person":"Edward","dialogue":"So the idea is it's, It's, it's one one level above a raw transcript."},{"time":"12:04","person":"Ankit Mehta","dialogue":"Yes."},{"time":"12:04","person":"Edward","dialogue":"So a lot of the, the arms the oz. The like intros like, oh, you know, the small talk and stuff like that is, is skimmed out, and you're left with what is hopefully the essence, the essentials, the essential facts are essential topics of the meeting itself."},{"time":"12:26","person":"Ankit Mehta","dialogue":"Yes, so Okay, a thing that Grace's insight was that this is too long, a summary for 30 to 40 minute meetings so like meaning you also need to like figure out a way to be a bit more concise one that's actually one of the main skills that from meeting to meeting notes, the program manager does is that they make very concise stuff that doesn't get, but that doesn't lose, lose out on any information. So we're just trying to figure out what the right compression is in a sense, for for something like this, right, because it's just not a time factor right it just could be like the amount of topics that are discussed and every meeting is different in terms of like the density of topics that are discussed. So, we're still trying to figure out what the right length is we're playing around with like hyper parameters read show that's the word, to figure out"},{"time":"13:23","person":"Edward","dialogue":"our parameters like predefined the hyper parameters of the model to like decide the length, and, like, maybe like the number of stages or number of topics. So I mean, it definitely vary from meetings to meetings, but there should be a sweet spot which face most meetings, that's something we are trying to figure out. The first thing that I think of like if I'm, if I put myself in the position of someone who's who would have to use this, right, is how accurate is this summary like what, what got compressed out when you're compressing this information and how. So I guess the question is how, how are you gauging the accuracy of the summaries, right, like, Do you have a confidence level on this or I mean like, that's like the testing file so we don't have a like a target label to, like, compare contingently but I think we can. Yeah, I think that I,"},{"time":"14:37","person":"Ankit Mehta","dialogue":"yeah So, numbers, like, you can talk about the matrix right so no one's called the locus for the ICS."},{"time":"14:50","person":"Edward","dialogue":"Yeah, we don't have like ground truth or those kinds of meetings."},{"time":"14:55","person":"Ankit Mehta","dialogue":"Right. Okay, sure. So, I would say those are the scores that were part of this model earlier as well. So those are essentially a will to find out what has been the overlap between the summary and the transcript so for example, row one is essentially one word taken alone, and the rope bill is two words taken composite and what was the overlap and LCS long longest common subsequence. So those are the few metrics that has been used in the literature to actually find out how much for relation is there between the summary and the transcript."},{"time":"17:12","person":"Edward","dialogue":"that is you is your model giving you a confidence index or a confidence number on on these summaries."},{"time":"17:19","person":"Ankit Mehta","dialogue":"No,"},{"time":"17:22","person":"Edward","dialogue":"because I was thinking if you if you can write maybe you can put like a temperature gauge or something next to each one, like if it's a low confidence it goes towards red if it's higher confidence it goes towards green. You know because you want to make sure, like, with a product like this the people using it. You want them like a Ford TPM. A project manager, like part of their job is to get that summary right. And so, like if you can give them any help to understand. Okay, this thing. I don't need to go back to the transcript to figure out, but this thing. I, it's saying it's a read, so maybe I should click through this and read look a little bit more closely at the at the transcript to glean what the context is for my summary right. So again it's it's it's not, it's not like, like a huge jump from the transcript but you're making that transcript. Additionally, more useful, and you're giving the user more confidence in your product to help them, right, because, you know, we all know right the, the, when a robot reads things it gets everything, it gets pretty much. Well, he said it got 20% wrong, you know, and so we want to allow the robot to help the human but not lead the human right, so we want the human to be in control here so let the human use their judgment because that's what they're good at, and let the robot do what it's good at which is skimming through lots of text and telling you what it knows very well, and tells you what it thinks it knows, so that you, the human can do the judging part, because we're just not at that point yet, right, maybe you know, you know, in a couple more years that the technology will be there or if you do more iterations on this you will get there right. But you know it's kind of like acknowledging, being aware of what the shortcomings of the technology are and making up for them in the process and then making that process for the user, very streamlined and very easy to do. That makes sense yes"},{"time":"19:44","person":"Ankit Mehta","dialogue":"yes yes yeah."},{"time":"19:46","person":"Edward","dialogue":"Yeah, I think there are some ways to do it seems like sequence modeling, I think the model cannot generate the probability for each for the sentence they generated. So, I think there's a way to do it. Yeah,"},{"time":"20:03","person":"Ankit Mehta","dialogue":"yeah I think that's a good point we need to figure it out."},{"time":"20:05","person":"Edward","dialogue":"So, are these is each line here, like for example this one right here. Yeah. Is that considered a topic, because you mentioned you annotated topics so would that be a topic is one line, no that's another topic that's a like input dialog. Okay, like so. You can, like, consider them like they're all like in parallel. So each, each line is in parallel. Okay, so do you display the topics or that's the next step for you. So like display the topic, explicitly, right, you said your ML model is segmenting the transcript, and then extracting topics from it. Yes. So how are you making use of those topics that have been extracted."},{"time":"21:05","person":"Ankit Mehta","dialogue":"Actually, at this point of time."},{"time":"21:07","person":"Edward","dialogue":"Okay, all right, that was Mike that's really where I wanted to understand it. Yeah, that's, that's down the road or not okay"},{"time":"21:12","person":"Ankit Mehta","dialogue":"yeah, it's just yeah, I mean that's like, you know, that's a output that we have to pull out and then integrate into something that we can visualize and the topic currently is actually just like machine, it comes out in machine language in the as an output. Currently, so we don't know it does all of that internally, and we haven't figured out a way to actually convert those topics into like actual words at this point of time. So, okay,"},{"time":"22:29","person":"Edward","dialogue":"Well, um, what do you have any theories, at this point about what an MVP would look like."},{"time":"22:35","person":"Ankit Mehta","dialogue":"Yes, okay. Yeah, so my, my version of an MVP would be something like a person they would be able to upload that transcript. That is something that's available to us. If you record the meeting, so they upload the transcript and they received this, and this being while being like the what, what you're seeing right now just the summaries, no action, no action items. And if, at least right now I think the confidence level, we're speaking to you I think confidence level is super important for the MVP so at least that. But action items and things like that would be like a version two thing."},{"time":"23:15","person":"Edward","dialogue":"Okay. Where would, where would the user get the summary from. So, I'm sorry that the transcript."},{"time":"23:23","person":"Ankit Mehta","dialogue":"The transcript is so well if you record a Zoom meeting, like so the Cornell Tech portal for zoom, allows you to actually download the audio file the transcript, the video and everything. Okay, okay, so they will get the transcript from there, I know you guys use Hangouts. For this,"},{"time":"23:43","person":"Edward","dialogue":"he, we, like, personally I use otter, or like some meetings I will transcribe in Otter, does there need to be these things in a specific format or can it just be a list of sentences or list of words."},{"time":"24:01","person":"Ankit Mehta","dialogue":"Currently it's in the like zoom transcript meeting which is actually generated from auto for us to like otter is otter is doing the transcription. Not this one, the one you're currently seeing but if he recorded this meeting, and then got the summary out that would have been done by otter. Alright. I use otter a lot."},{"time":"24:23","person":"Edward","dialogue":"I think that's a good start. Right. And so, so once the user gets the summary. Right, so, I think you're going to want to be clear with the user what all of this summary means, right, so like, what, like why is this particular like I'm asking rhetorically right but like, I know I approaching this as a user, my first question is like what do these mean. These lines that are highlighted, are those action items, but no the action I, but it looks like there are only three action items here, but these don't seem particularly actionable to me as action items is down here."},{"time":"25:08","person":"Ankit Mehta","dialogue":"Yeah. Yeah."},{"time":"25:12","person":"Edward","dialogue":"I think you want to you want to refine the UI a bit to make it clear what is the user supposed to do with your tool. After they've received these summaries that you're presenting to me. You know, because an MVP needs to be able to carry a person from point A to point B, where you're defining what point am br So, currently the way you've defined that journey is upload a transcript, receive some summaries, but that seems incomplete to me. It seems like if I'm using this, I'd want to know, what do I do now with these summaries Do I just beat them. But when I read them they don't let me be, you know, it'd be good to see like the content of a meeting that I was in, to understand better what these summaries are. Did you when you worked with Rob and grace. Did you actually have a meeting with them, and then upload the transcripts to this, and then show them the results so that they could actually see how it works. No, no,"},{"time":"26:27","person":"Ankit Mehta","dialogue":"that's actually also something that we actually need to be doing we need to be able to iterate through our whole process more quickly. Currently, it takes a little while and also you need to be able to like get permission to record someone in a meeting. And that, I mean, I for at least zoom specifically I can't actually generate the transcript to like, close the meeting, so it's not something that I can iterate over quickly like it takes about like 15 minutes to generate transcript regardless. So,"},{"time":"26:59","person":"Edward","dialogue":"I mean if you were to approach, saying grace and Rob and I think that Gavin is back from vacation and say, We would like to have a meeting with you where we record the conversation, Right, and so the first five minutes or 10 minutes of the conversation would be recorded and just use otter pointing up to the microphone on the computer, and then after that, upload that transcript to your tool, and then show them the summaries, and then have them describe to you what their experience of the summaries, is, you know, because I think you want to, like I think that could be like a pre MVP what you describe is like we're receiving the summaries, and then from that, you could probably get some better direction as to what you could do with those summaries. But I say that, but I, I say that in the abstract, I don't know what your timeline is I'm, you're probably reaching the end of your semester and you probably won't have a lot of time for it. Is that the case."},{"time":"28:15","person":"Ankit Mehta","dialogue":"Yeah, we have about one and a half months left in which I think most of us will just focus on recruiting and final exams. So right deliverables,"},{"time":"28:29","person":"Edward","dialogue":"right, So let's say this is the MVP then, let's say, you know, I think that, you know, having confidence is displayed, would help, like, even if it's a color diagram or from zero to 100%, confidence, you said number will help gauge, the response of the person to what you've written, like so if something is a low confidence, then maybe they'll just skip that or maybe if it's below a certain threshold you hyperlink into the, into the transcript so that they can read that section of the transcript to get more context on it. But if it's 100%, confidence, then maybe you don't need to link or if it's 90% confidence, you don't need to link it. And then you could also even do something where it just don't show anything that's below 75% or 50% confidence to skip it."},{"time":"29:39","person":"Ankit Mehta","dialogue":"Yeah. Alright."},{"time":"29:48","person":"Edward","dialogue":"Um. Now, you said you wanted to know somebody at Squarespace would use this, would you want to, like, how would that work, is this something that self driving like someone can just go ahead and upload their own transcript and then do a few of them, and then come back to you with some feedback."},{"time":"30:08","person":"Ankit Mehta","dialogue":"Yes. I mean it's not currently self driving but whatever we do do end up doing me, I mean the very basic MVP process because I thought this process of creating a login would. I mean be a barrier and be a lot of effort to code so like the initial thing would have been like you receive, you are on a page where it just says upload you upload your transcript, and maybe an email address, and so we start working on the mod on the summary on the backend and using your email address, we send you a hyperlink, which is basically this but slash and Id meeting ID of sorts, and then once you land on that, using that Id we're able to pull that summary from the backend and display the specific summary that is only relevant to you."},{"time":"31:02","person":"Edward","dialogue":"How long does it take to generate the summary,"},{"time":"31:06","person":"Ankit Mehta","dialogue":"end to end, I think putting all processes because because it's actually currently processes putting it through three separate models separately. So I think show you said this takes about one minute right at the max to generate like for what somebody should be. So, I think you're not longer than that,"},{"time":"31:30","person":"Edward","dialogue":"for how long, how long have a meeting,"},{"time":"31:33","person":"Ankit Mehta","dialogue":"an honor to is what we've tested at max, we've actually only like an hour long meeting so yeah."},{"time":"31:40","person":"Edward","dialogue":"Does, does it get more accurate for longer meetings or would it be more accurate with short meetings like 15 minutes or 20 to 30 minutes, I will say, You should be more precise with shorter meaning mediums. So you might say to people, well I mean, meetings tend to be around 30 minutes. Oh, it's considered to be a long meeting at Squarespace if it's an hour. So if you have it, does it work, how well does it work with multiple people, is there an optimum number of people."},{"time":"32:17","person":"Ankit Mehta","dialogue":"The paper though. Sorry,"},{"time":"32:19","person":"Edward","dialogue":"I don't think that's a that's a limit. But is it more accurate if it has fewer people."},{"time":"32:28","person":"Ankit Mehta","dialogue":"Yes, then yeah"},{"time":"32:29","person":"Edward","dialogue":"I think so, like, like sometimes like the summary will like. Say we like mentioned someone mentioned their name in our meetings. The summary will sometimes generate their names. In this, like, as a result. That's,"},{"time":"34:39","person":"Ankit Mehta","dialogue":"yeah, that's definitely the, like, the final version of the product would definitely have something like that where a board joins your meeting you invite about to the calendar of your meeting and then they join it. So, but it's, it's, it's really hard to like figure out exactly then, then it requires actually then listening into like transcribed from Amazon. That's the thing. So that's the voice to texting that will need to integrate and then also figure out a way for like a creative board that joins meetings and things like,"},{"time":"35:12","person":"Edward","dialogue":"Oh, well, yeah, I was just thinking that one of you would just be invited to the meeting. Okay, right, and then you could do the work of making sure that it's recorded properly, you know that the hosts of the meeting could ensure that the meeting is structured appropriately like there's the right number of people it's the right length and so forth. But then you would be making sure that the technology all work and fit in, you know, okay, yeah, you think that would help you at all."},{"time":"35:51","person":"Ankit Mehta","dialogue":"Yeah, yeah, we would need needed to join a join and create a transcript, but if we're able to do so we can definitely actually be able to test like, you know somebody that people care about. So that's something that we can definitely see work towards."},{"time":"36:10","person":"Edward","dialogue":"I can think of one, like so, one of my teams for the unfold app, they have an engineering leadership meeting once a week. That's so all of the leads, there's an agenda for that meeting. It's fairly well structured in terms of how they communicate and such. I could ask the engineering manager for that team if you'd be open to having you join it."},{"time":"36:36","person":"Ankit Mehta","dialogue":"That sounds great, but we do want to, I mean, I think this, the communication for that for like you actually talking to them, we should actually just wait till we have like internally figured out, we were able to do to end to end, and then I'll mail you and then you can talk to them."},{"time":"36:56","person":"Edward","dialogue":"Yeah. And, you know, let's, let's be pragmatic about it like everything doesn't have to be perfect, and this group of people that I'm recommending is, you know, will be a very supportive audience like they'll, you know, They'll want to make it work for you. So, yeah, there used to buggy software. Yeah, you know, early, early alphas and such. But, um, so alright so that, so I guess, you know, I think, so that you would upload a transcript, it would produce a summary. And then you want to be able to rank the summaries by some degree of confidence. And, you know, and, like, maybe if there were sorted by car, I don't know what makes more sense if they're sorted by time or by confidence but. So I guess the only thing is, then, is what what does one do with that. And I guess the, in that case, the, the, your use case of a TPM, then mailing it out, is ultimately what you, what you're what you're looking at right. Yes. So maybe what you could do is have like a, like, an email compose function at the bottom that you know or like on the side right, so they can have the summary on the left, and then an email compose area on the right where they could actually do the work of composing the email while reviews and reviewing the summary and maybe copy and paste over from the summary into the email when it makes sense. But, you know you're, you know, providing a workspace for them to do their work, that allows them to see the summary and then be able to type up the email. Could you just"},{"time":"39:02","person":"Ankit Mehta","dialogue":"add a bit into that. In terms of what exactly I mean. So we were thinking exactly how exporting all this information would look like. And the email part were what we thought was the, I mean the most easiest and the best thing for our user we could do was, for each individual line item you could create like that copy button that is married, and then you click on that and copy it so it's saving one click, or like the option of not having to select and then you compose your email in your email client because, I mean how hard we're gonna work, we're not gonna be like Gmail,"},{"time":"39:41","person":"Edward","dialogue":"like email,"},{"time":"39:42","person":"Ankit Mehta","dialogue":"yeah so yeah that makes sense in terms, we did, actually. So the initial version of this the input boxes were a lot more fancier they're actually rich text editors, but I couldn't get it to work. Before we were supposed to demo with Rob So I scrapped it and just made it a normal text area box."},{"person":"Transcribed by https://otter.ai","dialogue":""}]